rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars"], ["rating", "PG"], ["updated_at", "2018-10-04 21:13:34.459172"], ["id", 12]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_similar
    @similar_movies = nil
    @movie = Movie.find(params[:movie_id])
    director = @movie.director
    if !(director.nil? || director.empty?)
      @similar_movies = Movie.where(:director => director)